Revit 2027 API
BuiltInFailures.RebarShapeFailures.InvalidCrankParametersCombination Property
 Invalid combination of crank parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidCrankParametersCombination { get; }
Public Shared ReadOnly Property InvalidCrankParametersCombination As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidCrankParametersCombination {
	FailureDefinitionId^ get ();
}
static member InvalidCrankParametersCombination : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace